; domain
(define (domain lec-winter-split)
    (:requirements :strips :typing :equality :negative-preconditions)
    
    (:types 
        match team referee server slot - object
    )
    
    (:constants 
        home away - slot 
    )

    (:predicates
        ;; Topología del torneo
        (connected ?m1 - match ?m2 - match ?s - slot)
        (participant ?t - team ?m - match ?s - slot)
        
        ;; Estado del Partido
        (scheduled ?m - match)          ;; Partido en lobby/champ select
        (played ?m - match)             ;; La partida terminó (nexus explota)
        (result-reported ?m - match)    ;; El arbitro firmó el acta
        (verified ?m - match)           ;; La liga validó el resultado final
        (winner-determined ?m - match)  ;; Hay un ganador oficial
        (winner ?m - match ?t - team)
        
        ;; Gestión de Conflictos e Incidencias
        (has-conflict ?m - match)       ;; PREDICADO ESTÁTICO: Indica que este match "está gafado" y fallará
        (protest-active ?m - match)     ;; Hay una pausa/protesta en curso
        (protest-handled ?m - match)    ;; La protesta se resolvió (se mantiene el resultado)
        
        ;; Recursos
        (ref-available ?r - referee)
        (server-available ?s - server)
        (referee-assigned ?r - referee ?m - match)
    )

    ;; --- FASE 1: PREPARACIÓN ---

    (:action start-champ-select
        :parameters (?m - match ?s - server ?t1 - team ?t2 - team)
        :precondition (and 
            (participant ?t1 ?m home)
            (participant ?t2 ?m away)
            (not (scheduled ?m))
            (not (winner-determined ?m))
            (server-available ?s)
        )
        :effect (and 
            (scheduled ?m)
            (not (server-available ?s)) ;; Ocupamos servidor
        )
    )

    ;; --- FASE 2: EJECUCIÓN (JUGAR) ---

    ;; Opción A: Partida Limpia (Solo si NO hay conflicto predefinido)
    (:action play-clean-game
        :parameters (?m - match ?s - server ?r - referee)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (ref-available ?r)
            (not (has-conflict ?m)) ;; Condición clave: Solo si no está "gafado"
        )
        :effect (and 
            (played ?m)
            (server-available ?s)      ;; Liberamos server al acabar
            (not (ref-available ?r))   ;; Ocupamos árbitro para el acta
            (referee-assigned ?r ?m)
        )
    )

    ;; Opción B: Partida con Bug (Obligatoria si hay conflicto predefinido)
    (:action play-with-technical-issue
        :parameters (?m - match ?s - server ?r - referee)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (ref-available ?r)
            (has-conflict ?m)       ;; Condición clave: El planificador DEBE elegir esta
        )
        :effect (and 
            (played ?m)
            (protest-active ?m)     ;; Se activa la incidencia
            (server-available ?s)   ;; Liberamos server
            (not (ref-available ?r))
            (referee-assigned ?r ?m)
        )
    )

    ;; --- FASE 3: RESOLUCIÓN DE INCIDENCIAS ---

    ;; Resolución 1: Ruling Confirm (El bug no afecta, seguimos)
    (:action adjudicate-ruling-confirm
        :parameters (?m - match ?r - referee)
        :precondition (and 
            (protest-active ?m)
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (not (protest-active ?m))
            (protest-handled ?m)
        )
    )

    ;; Resolución 2: Chronobreak/Replay (Borramos lo jugado)
    (:action adjudicate-chronobreak-replay
        :parameters (?m - match ?r - referee)
        :precondition (and 
            (protest-active ?m)
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (not (protest-active ?m))
            (not (played ?m))           ;; OJO: Reseteamos estado
            (not (has-conflict ?m))     ;; ASUNCIÓN: El replay arregla el bug (evita bucles infinitos)
            (not (referee-assigned ?r ?m))
            (ref-available ?r)          ;; Liberamos al árbitro para que vuelva a empezar
            ;; El partido sigue (scheduled ?m), así que se puede volver a jugar
        )
    )

    ;; --- FASE 4: ACTA Y VERIFICACIÓN ---

    ;; El árbitro firma el acta
    (:action sign-match-sheet
        :parameters (?m - match ?t - team ?r - referee)
        :precondition (and 
            (played ?m)
            (participant ?t ?m home) ;; Simplificación: Asumimos que gana HOME (para que el planner elija)
            (not (result-reported ?m))
            (not (protest-active ?m))
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (result-reported ?m)
            (winner ?m ?t)
            (not (referee-assigned ?r ?m))
            (ref-available ?r) ;; Liberamos al árbitro
        )
    )

    ;; La liga verifica el resultado (Burocracia final)
    (:action verify-result
        :parameters (?m - match)
        :precondition (and 
            (result-reported ?m)
            (not (verified ?m))
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
        )
    )

    ;; --- OPCIÓN ESPECIAL: NO-SHOW (Sanción) ---
    (:action declare-noshow
        :parameters (?m - match ?t - team)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (participant ?t ?m home) ;; O away, el planner decide quién gana por incomparecencia
        )
        :effect (and 
            (played ?m)
            (result-reported ?m)
            (winner ?m ?t)
            (verified ?m)
            (winner-determined ?m)
            ;; Si usamos esta acción, asumimos que liberamos recursos implícitamente
        )
    )

    ;; --- FASE 5: AVANCE DE BRACKET ---

    (:action promote-to-next-round
        :parameters (?m_src - match ?m_dst - match ?t - team ?s - slot)
        :precondition (and 
            (winner-determined ?m_src)
            (winner ?m_src ?t)
            (connected ?m_src ?m_dst ?s)
        )
        :effect (and 
            (participant ?t ?m_dst ?s)
        )
    )
)

; problem
(define (problem lec-16-R4-S4-P40)
    (:domain lec-winter-split)
    (:objects
        team-1 team-2 team-3 team-4 team-5 team-6 team-7 team-8 team-9 team-10 team-11 team-12 team-13 team-14 team-15 team-16 - team
        m1 m2 m3 m4 m5 m6 m7 m8 m9 m10 m11 m12 m13 m14 m15 - match
        ref-1 ref-2 ref-3 ref-4 - referee
        server-1 server-2 server-3 server-4 - server
    )
    (:init
        (ref-available ref-1)
        (ref-available ref-2)
        (ref-available ref-3)
        (ref-available ref-4)
        (server-available server-1)
        (server-available server-2)
        (server-available server-3)
        (server-available server-4)
        (participant team-1 m1 home)
        (participant team-2 m1 away)
        (participant team-3 m2 home)
        (participant team-4 m2 away)
        (participant team-5 m3 home)
        (participant team-6 m3 away)
        (participant team-7 m4 home)
        (participant team-8 m4 away)
        (participant team-9 m5 home)
        (participant team-10 m5 away)
        (participant team-11 m6 home)
        (participant team-12 m6 away)
        (participant team-13 m7 home)
        (participant team-14 m7 away)
        (participant team-15 m8 home)
        (participant team-16 m8 away)
        (connected m1 m9 home)
        (connected m2 m9 away)
        (connected m3 m10 home)
        (connected m4 m10 away)
        (connected m5 m11 home)
        (connected m6 m11 away)
        (connected m7 m12 home)
        (connected m8 m12 away)
        (connected m9 m13 home)
        (connected m10 m13 away)
        (connected m11 m14 home)
        (connected m12 m14 away)
        (connected m13 m15 home)
        (connected m14 m15 away)
        (has-conflict m1)
        (has-conflict m2)
        (has-conflict m4)
        (has-conflict m6)
        (has-conflict m7)
        (has-conflict m11)
    )
    (:goal
        (verified m15)
    )
)

; plan
1. (start-champ-select m6 server-1 team-11 team-12)
   deleted: (server-available server-1)
   added: (scheduled m6)
   goals met: 0 of 1
2. (start-champ-select m1 server-2 team-1 team-2)
   deleted: (server-available server-2)
   added: (scheduled m1)
   goals met: 0 of 1
3. (start-champ-select m2 server-3 team-3 team-4)
   deleted: (server-available server-3)
   added: (scheduled m2)
   goals met: 0 of 1
4. (declare-noshow m6 team-11)
   added: (played m6) (result-reported m6) (winner m6 team-11) (verified m6) (winner-determined m6)
   goals met: 0 of 1
5. (promote-to-next-round m6 m11 team-11 away)
   added: (participant team-11 m11 away)
   goals met: 0 of 1
6. (declare-noshow m1 team-1)
   added: (played m1) (result-reported m1) (winner m1 team-1) (verified m1) (winner-determined m1)
   goals met: 0 of 1
7. (promote-to-next-round m1 m9 team-1 home)
   added: (participant team-1 m9 home)
   goals met: 0 of 1
8. (declare-noshow m2 team-3)
   added: (played m2) (result-reported m2) (winner m2 team-3) (verified m2) (winner-determined m2)
   goals met: 0 of 1
9. (promote-to-next-round m2 m9 team-3 away)
   added: (participant team-3 m9 away)
   goals met: 0 of 1
10. (start-champ-select m9 server-4 team-1 team-3)
   deleted: (server-available server-4)
   added: (scheduled m9)
   goals met: 0 of 1
11. (play-clean-game m9 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m9) (server-available server-1) (referee-assigned ref-1 m9)
   goals met: 0 of 1
12. (sign-match-sheet m9 team-1 ref-1)
   deleted: (referee-assigned ref-1 m9)
   added: (result-reported m9) (winner m9 team-1) (ref-available ref-1)
   goals met: 0 of 1
13. (verify-result m9)
   added: (verified m9) (winner-determined m9)
   goals met: 0 of 1
14. (promote-to-next-round m9 m13 team-1 home)
   added: (participant team-1 m13 home)
   goals met: 0 of 1
15. (start-champ-select m3 server-1 team-5 team-6)
   deleted: (server-available server-1)
   added: (scheduled m3)
   goals met: 0 of 1
16. (play-clean-game m3 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m3) (server-available server-1) (referee-assigned ref-1 m3)
   goals met: 0 of 1
17. (sign-match-sheet m3 team-5 ref-1)
   deleted: (referee-assigned ref-1 m3)
   added: (result-reported m3) (winner m3 team-5) (ref-available ref-1)
   goals met: 0 of 1
18. (verify-result m3)
   added: (verified m3) (winner-determined m3)
   goals met: 0 of 1
19. (promote-to-next-round m3 m10 team-5 home)
   added: (participant team-5 m10 home)
   goals met: 0 of 1
20. (start-champ-select m4 server-1 team-7 team-8)
   deleted: (server-available server-1)
   added: (scheduled m4)
   goals met: 0 of 1
21. (play-with-technical-issue m4 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m4) (protest-active m4) (server-available server-1) (referee-assigned ref-1 m4)
   goals met: 0 of 1
22. (adjudicate-chronobreak-replay m4 ref-1)
   deleted: (protest-active m4) (played m4) (has-conflict m4) (referee-assigned ref-1 m4)
   added: (ref-available ref-1)
   goals met: 0 of 1
23. (declare-noshow m4 team-7)
   added: (played m4) (result-reported m4) (winner m4 team-7) (verified m4) (winner-determined m4)
   goals met: 0 of 1
24. (promote-to-next-round m4 m10 team-7 away)
   added: (participant team-7 m10 away)
   goals met: 0 of 1
25. (start-champ-select m10 server-1 team-5 team-7)
   deleted: (server-available server-1)
   added: (scheduled m10)
   goals met: 0 of 1
26. (play-clean-game m10 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m10) (server-available server-1) (referee-assigned ref-1 m10)
   goals met: 0 of 1
27. (sign-match-sheet m10 team-5 ref-1)
   deleted: (referee-assigned ref-1 m10)
   added: (result-reported m10) (winner m10 team-5) (ref-available ref-1)
   goals met: 0 of 1
28. (verify-result m10)
   added: (verified m10) (winner-determined m10)
   goals met: 0 of 1
29. (promote-to-next-round m10 m13 team-5 away)
   added: (participant team-5 m13 away)
   goals met: 0 of 1
30. (start-champ-select m13 server-1 team-1 team-5)
   deleted: (server-available server-1)
   added: (scheduled m13)
   goals met: 0 of 1
31. (play-clean-game m13 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m13) (server-available server-1) (referee-assigned ref-1 m13)
   goals met: 0 of 1
32. (sign-match-sheet m13 team-1 ref-1)
   deleted: (referee-assigned ref-1 m13)
   added: (result-reported m13) (winner m13 team-1) (ref-available ref-1)
   goals met: 0 of 1
33. (verify-result m13)
   added: (verified m13) (winner-determined m13)
   goals met: 0 of 1
34. (promote-to-next-round m13 m15 team-1 home)
   added: (participant team-1 m15 home)
   goals met: 0 of 1
35. (start-champ-select m5 server-1 team-9 team-10)
   deleted: (server-available server-1)
   added: (scheduled m5)
   goals met: 0 of 1
36. (play-clean-game m5 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m5) (server-available server-1) (referee-assigned ref-1 m5)
   goals met: 0 of 1
37. (sign-match-sheet m5 team-9 ref-1)
   deleted: (referee-assigned ref-1 m5)
   added: (result-reported m5) (winner m5 team-9) (ref-available ref-1)
   goals met: 0 of 1
38. (verify-result m5)
   added: (verified m5) (winner-determined m5)
   goals met: 0 of 1
39. (promote-to-next-round m5 m11 team-9 home)
   added: (participant team-9 m11 home)
   goals met: 0 of 1
40. (start-champ-select m11 server-1 team-9 team-11)
   deleted: (server-available server-1)
   added: (scheduled m11)
   goals met: 0 of 1
41. (play-with-technical-issue m11 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m11) (protest-active m11) (server-available server-1) (referee-assigned ref-1 m11)
   goals met: 0 of 1
42. (adjudicate-chronobreak-replay m11 ref-1)
   deleted: (protest-active m11) (played m11) (has-conflict m11) (referee-assigned ref-1 m11)
   added: (ref-available ref-1)
   goals met: 0 of 1
43. (declare-noshow m11 team-9)
   added: (played m11) (result-reported m11) (winner m11 team-9) (verified m11) (winner-determined m11)
   goals met: 0 of 1
44. (promote-to-next-round m11 m14 team-9 home)
   added: (participant team-9 m14 home)
   goals met: 0 of 1
45. (start-champ-select m7 server-1 team-13 team-14)
   deleted: (server-available server-1)
   added: (scheduled m7)
   goals met: 0 of 1
46. (play-with-technical-issue m7 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m7) (protest-active m7) (server-available server-1) (referee-assigned ref-1 m7)
   goals met: 0 of 1
47. (adjudicate-chronobreak-replay m7 ref-1)
   deleted: (protest-active m7) (played m7) (has-conflict m7) (referee-assigned ref-1 m7)
   added: (ref-available ref-1)
   goals met: 0 of 1
48. (declare-noshow m7 team-13)
   added: (played m7) (result-reported m7) (winner m7 team-13) (verified m7) (winner-determined m7)
   goals met: 0 of 1
49. (promote-to-next-round m7 m12 team-13 home)
   added: (participant team-13 m12 home)
   goals met: 0 of 1
50. (start-champ-select m8 server-1 team-15 team-16)
   deleted: (server-available server-1)
   added: (scheduled m8)
   goals met: 0 of 1
51. (play-clean-game m8 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m8) (server-available server-1) (referee-assigned ref-1 m8)
   goals met: 0 of 1
52. (sign-match-sheet m8 team-15 ref-1)
   deleted: (referee-assigned ref-1 m8)
   added: (result-reported m8) (winner m8 team-15) (ref-available ref-1)
   goals met: 0 of 1
53. (verify-result m8)
   added: (verified m8) (winner-determined m8)
   goals met: 0 of 1
54. (promote-to-next-round m8 m12 team-15 away)
   added: (participant team-15 m12 away)
   goals met: 0 of 1
55. (start-champ-select m12 server-1 team-13 team-15)
   deleted: (server-available server-1)
   added: (scheduled m12)
   goals met: 0 of 1
56. (play-clean-game m12 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m12) (server-available server-1) (referee-assigned ref-1 m12)
   goals met: 0 of 1
57. (sign-match-sheet m12 team-13 ref-1)
   deleted: (referee-assigned ref-1 m12)
   added: (result-reported m12) (winner m12 team-13) (ref-available ref-1)
   goals met: 0 of 1
58. (verify-result m12)
   added: (verified m12) (winner-determined m12)
   goals met: 0 of 1
59. (promote-to-next-round m12 m14 team-13 away)
   added: (participant team-13 m14 away)
   goals met: 0 of 1
60. (start-champ-select m14 server-1 team-9 team-13)
   deleted: (server-available server-1)
   added: (scheduled m14)
   goals met: 0 of 1
61. (play-clean-game m14 server-1 ref-1)
   deleted: (ref-available ref-1)
   added: (played m14) (server-available server-1) (referee-assigned ref-1 m14)
   goals met: 0 of 1
62. (sign-match-sheet m14 team-9 ref-1)
   deleted: (referee-assigned ref-1 m14)
   added: (result-reported m14) (winner m14 team-9) (ref-available ref-1)
   goals met: 0 of 1
63. (verify-result m14)
   added: (verified m14) (winner-determined m14)
   goals met: 0 of 1
64. (promote-to-next-round m14 m15 team-9 away)
   added: (participant team-9 m15 away)
   goals met: 0 of 1
65. (start-champ-select m15 server-1 team-1 team-9)
   deleted: (server-available server-1)
   added: (scheduled m15)
   goals met: 0 of 1
66. (declare-noshow m15 team-1)
   added: (played m15) (result-reported m15) (winner m15 team-1) (verified m15) (winner-determined m15)
   goals met: 1 of 1
